Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: |Параметр|Значение по умолчанию|Описание| |:-|:-|:-| |Прослушиваемые адреса|0.0.0.0|Адрес или адреса проверяемые на наличие сервера| |TCP порт|4580|Порт используемый для соединения с сервером| |WebSocket порт|8080|Порт используемый для обмена сообщениями с сервером| |WebSocket SSL/TLS порт| если настроено WSS (WebSocket Secure), то 8443, иначе null|Защищенный порт используемый для обмена сообщениями с сервером| |Имя файла сертификата||Путь к файлу сертификата используемого для SSL-соединения.
en: |Parameter|Default value|Description| |:-|:-|:-| |Listen addresses|0.0.0.0|Address or addresses listened on the server availability| |TCP port|4580|The port used for the server connection| |WebSocket port|8080|The port used for message exchange with server| |WebSocket SSL/TLS port| if WSS (WebSocket Secure) is configured, 8443, otherwise null|The secure port used for message exchange with server| |Certificate file name||Path to the certificate file used for the SSL connection.

source: |Параметр|Значение по умолчанию|Описание| |:-|:-|:-| |Размер пула пакетов|10|Количество часто используемых в пакетной обработке и пакетов Loginom Integrator, сохраненных для быстрого вызова| |Таймаут остановки сервера (сек.)|10|Время выделяемое серверу на завершение работы.
en: |Parameter|Default value|Description| |:-|:-|:-| |Package pool size|10|The number of the Loginom Integrator packages frequently used in the batch processing saved for the quick call| |Server stop timeout (s)|10|The time allocated to the server to complete operation.

source: |Параметр|Значение по умолчанию|Описание| |:-|:-|:-| |Уровень логирования|Информация|Здесь указывается способ и полнота заполнения лог-файла (Трассировка, Отладка, Информация, Событие, Предупреждение, Ошибка и Авария)| |Имя файла|app.log|Параметр содержит имя лог-файла.
en: |Parameter|Default value|Description| |:-|:-|:-| |Logging level|Information|Method and completeness of the log file filing is specified here (Trace, Debug, Information, Event, Warning, Error and Fatal)| |File name|app.log|The parameter contains the log file name.

source: |Параметр|Значение по умолчанию|Описание| |:-|:-|:-| |Хост||Доменное имя хоста (либо IP-адрес) LDAP сервера.
en: |Parameter|Default value|Description| |:-|:-|:-| |Host||Domain host name (or IP address) of the LDAP server.

source: |Параметр|Описание| |:-|:-| |Логин|Имя пользователя используемое для входа в систему.
en: |Parameter|Description| |:-|:-| |Login|Username used for login.

source: |Показатель| | | ||| |:-|:-:|:-:|:-:|:-:|:-:| |Гистограмма|| | ||| |Диаграмма размаха|||||| |Минимум|| | ||| |Максимум|| | ||| |Среднее|| | ||| |Стандартное отклонение|| | || | |Несмещенная дисперсия|| |||| |Нижний квартиль|||||| |Медиана|||||| |Верхний квартиль|||||| |Межквартильный размах^1|||||| |Медианное абсолютное отклонение|||||| |Сумма|| |||| |Размах^2|| | ||| |Пропуски|| | ||| |Значения^3|| | ||| |Уникальные|| |||| |Минимальная длина строки|||||| |Максимальная длина строки|||||| |Средняя длина строки||||||
en: |Indicator| | | ||| |:-|:-:|:-:|:-:|:-:|:-:| |Histogram|| | ||| |Box plot|||||| |Minimum|| | ||| |Maximum|| | ||| |Average|| | ||| |Standard deviation|| | || | |Unbiased variance|| |||| |Lower quartile|||||| |Median|||||| |Upper quartile|||||| |Interquartile range^1|||||| |Median absolute deviation|||||| |Sum|| |||| |Range^2|| | ||| |Null count|| | ||| |Values^3|| | ||| |Unique|| |||| |Minimum string length|||||| |Maximum string length|||||| |Mean string length||||||

source: |Точка продажи|Дата|Сумма продажи| |:-|:-|-:| |Павильон|11.04.2012|320| |Павильон|12.04.2012|190| |Павильон|13.04.2012|490| |СтройРынок|10.04.2012|705| |СтройРынок|12.04.2012|130| |СтройРынок|13.04.2012|65|
en: |Point of sale|Date|Amount of sale| |:-|:-|-:| |Trade stand|11.04.2012|320| |Trade stand|12.04.2012|190| |Trade stand|13.04.2012|490| |StroyRynok|10.04.2012|705| |StroyRynok|12.04.2012|130| |StroyRynok|13.04.2012|65|

source: |Точка продажи|Товар|Сумма продажи|Дата| |:-|:-|-:|:-| |СтройРынок|Обои|170|10.04.2012| |СтройРынок|Плитка|400|10.04.2012| |СтройРынок|Герметик|135|10.04.2012| |Павильон|Обои|240|11.04.2012| |Павильон|Плитка|80|11.04.2012| |Павильон|Герметик|40|12.04.2012| |СтройРынок|Обои|130|12.04.2012| |Павильон|Обои|130|12.04.2012| |Павильон|Плитка|20|12.04.2012| |Павильон|Обои|230|13.04.2012| |СтройРынок|Герметик|65|13.04.2012| |Павильон|Герметик|260|13.04.2012|
en: |Point of sale|Goods|Amount of sale|Date| |:-|:-|-:|:-| |StroyRynok|Wallpaper|170|10.04.2012| |StroyRynok|Tiles|400|10.04.2012| |StroyRynok|Sealer|135|10.04.2012| |Trade stand|Wallpaper|240|11.04.2012| |Trade stand|Tiles|80|11.04.2012| |Trade stand|Sealer|40|12.04.2012| |StroyRynok|Wallpaper|130|12.04.2012| |Trade stand|Wallpaper|130|12.04.2012| |Trade stand|Tiles|20|12.04.2012| |Trade stand|Wallpaper|230|13.04.2012| |StroyRynok|Sealer|65|13.04.2012| |Trade stand|Sealer|260|13.04.2012|

source: |ФИО|Год рождения| |:-|:-| |Абрамов|1972 г.| |Авдеева|1956 г.| |Агафонов|1978 г.| |Аксёнова|1979 г.| |Александров|1980 г.| |Алексеев|1983 г.| |Андреева|1982 г.| |Анисимов|1963 г.| |Антонов|1984 г.| |Артемьев|1965 г.|
en: |Full name|Year of birth| |:-|:-| |Abramov|1972| |Avdeyeva|1956| |Agafonov|1978| |Aksenova|1979| |Aleksandrov|1980| |Alekseyev|1983| |Andreyeva|1982| |Anisimov|1963| |Antonov|1984| |Artemyev|1965|

source: |ФИО|Год рождения|КТУ|Кластер| |:-|:-|:-|-:| |Абрамов|1972 г.|> 0.8|1| |Авдеева|1956 г.|> 0.8|1| |Агафонов|1978 г.|0.5 - 0.8|2| |Аксёнова|1979 г.|0.5 - 0.8|2| |Александров|1980 г.|0.2 - 0.5|3| |Алексеев|1983 г.|< 0.2|4| |Андреева|1982 г.|&#60;null>|&#60;null>| |Анисимов|1963 г.|&#60;null>|&#60;null>| |Антонов|1984 г.|&#60;null>|&#60;null>| |Артемьев|1965 г.|&#60;null>|&#60;null>| %/spoiler%
en: |Full name|Year of birth|Labor participation coefficient|Cluster| |:-|:-|:-|-:| |Abramov|1972|> 0.8|1| |Avdeyeva|1956|> 0.8|1| |Agafonov|1978|0.5 - 0.8|2| |Aksenova|1979|0.5 - 0.8|2| |Aleksandrov|1980|0.2 - 0.5|3| |Alekseyev|1983|< 0.2|4| |Andreyeva|1982|&#60;null>|&#60;null>| |Anisimov|1963|&#60;null>|&#60;null>| |Antonov|1984 |&#60;null>|&#60;null>| |Artemyev|1965|&#60;null>|&#60;null>| %/spoiler%

source: |ФИО|Год| |:-|:-| |Андреева|1982 г.| |Анисомов|1963 г.| |Антонов|1984 г.| |Артемьев|1965 г.|
en: |Full name|Year of birth| |:-|:-| |Andreyeva|1982| |Anisomov|1963| |Antonov|1984| |Artemyev|1965|

source: |ФИО|Год|КТУ|Кластер| |:-|:-|:-|-:| |Абрамов|1972 г.|\> 0.8|1| |Авдеева|1956 г.|\> 0.8|1| |Агафонов|1978 г.|0.5 - 0.8|2| |Аксёнова|1979 г.|0.5 - 0.8|2| |Александров|1980 г.|0.2 - 0.5|3| |Алексеев|1983 г.|< 0.2|4|
en: |Full name|Year of birth|Labor participation coefficient|Cluster| |:-|:-|:-|-:| |Abramov|1972|\> 0.8|1| |Avdeyeva|1956|\> 0.8|1| |Agafonov|1978|0.5 - 0.8|2| |Aksenova|1979|0.5 - 0.8|2| |Aleksandrov|1980|0.2 - 0.5|3| |Alekseyev|1983|< 0.2|4|

source: |ФИО|Год|КТУ|Кластер| |:-|:-|:-|-:| |Андреева|1982 г.|null|null| |Анисомов|1963 г.|null|null| |Антонов|1984 г.|null|null| |Артемьев|1965 г.|null|null| |Абрамов|1972 г.|\> 0.8|1| |Авдеева|1956 г.|\> 0.8|1| |Агафонов|1978 г.|0.5 - 0.8|2| |Аксёнова|1979 г.|0.5 - 0.8|2| |Александров|1980 г.|0.2 - 0.5|3| |Алексеев|1983 г.|< 0.2|4|
en: |Full name|Year of birth|Labor participation coefficient|Cluster| |:-|:-|:-|-:| |Andreyeva|1982|null|null| |Anisomov|1963|null|null| |Antonov|1984|null|null| |Artemyev|1965|null|null| |Abramov|1972|\> 0.8|1| |Avdeyeva|1956|\> 0.8|1| |Agafonov|1978|0.5 - 0.8|2| |Aksenova|1979|0.5 - 0.8|2| |Aleksandrov|1980|0.2 - 0.5|3| |Alekseyev|1983|< 0.2|4|

source: } } // Вывод результата функции в поле калькулятора return pow(COL1, COL2);
en: } } // Show the function result in the calculation field return pow(COL1, COL2);

source: А Кол-во SMS (Целый типЦелый тип), Кол-во минут вх (Целый типЦелый тип), Статус (Строковый типСтроковый тип), Наличие скидки (Логический типЛогический тип), выберем Транспонируемые Транспонируемыми.
en: And SMS number (Integer typeInteger type), Number of incoming minutes (Integer typeInteger type), Status (String typeString type), Discount availability (Logical typeLogical type) will be selected as Transposed Transposed.

source: А система автоматически производит все требуемые манипуляции, необходимые для работы с реляционной СУБД.
en: And the system automatically performs all operations required for the relational DBMS operation.

source: АКФ
en: ACF

source: Абсолютный путь
en: Absolute Path

source: Абсолютный путь — полный путь в файловой в системе.
en: The absolute path: the full path in the file system.

source: Автоматическая настройка:
en: Auto setup:

source: Автоматически в зависимости от границы
en: Automatically according to the bound

source: Автоматическое добавление пользователя
en: Auto Adding of User

source: Автоматическое обучение
en: Automatic Training

source: Автоматическое обучение Моделей можно осуществлять при пакетной обработке сценариев, в которой для каждого из узлов можно задать следующие варианты выполнения:
en: The automatic training of the Models can be performed while batch processing of the workflows in which it is possible to set the following execution options for each of the nodes:

source: Автоопределение числа кластеров.
en: Auto selection of clusters.

source: Авторизация для выполнения запроса
en: Authorization for Request Execution

source: Авторизация осуществляется по протоколу OAuth, который позволяет выдать одному сервису (приложению) права на доступ к ресурсам пользователя на другом сервисе.
en: The authorization process is implemented via OAuth protocol that grants rights to one service (application) to get access to the user resources available in another service.

source: Авторизация при выполнении запроса
en: Authorization for Request Execution

source: Адресная строка представляет собой навигационную цепочку объектов (см.
en: Address bar is a breadcrumb trail of objects (refer to

source: Активировать просмотр диаграммы можно кнопкой Диаграмма на Панели инструментов Куба.
en: It is possible to activate the chart view using the Chart button on the Cube Toolbar.

source: Активны будут ветви, указанные в списке Выполнять ветвь условия, который включает в себя:
en: The branches specified in Run condition branch list will be active. It includes the following components:

source: Алгоритм автоматически подбирает количество кластеров.
en: The algorithm selects the number of clusters automatically.

source: Алгоритм ищет точное совпадение исходных данных со значениями данного поля.
en: The algorithm searches for exact match of the source data with the values of this field.

source: Алгоритм обработки данных, входные и выходные порты производного компонента задаются базовым узлом.
en: The data processing algorithm, input and output ports of the derived component are set by the base node.

source: Алгоритм позволяет сортировать последовательно по нескольким полям.
en: The algorithm provides serial sorting by several fields.

source: Алгоритм синхронизации следующий:
en: The following synchronization algorithm is used:

source: Алгоритм создания связей пытается связать выходные поля/переменные, у которых нет связи, с входными, у которых нет связи:
en: The algorithm used to create links tries to map the output fields/variables that do not have links with the input ones that do not have links:

source: Алгоритм сортирует записи по первому в очереди полю сортировки в соответствии с заданным порядком.
en: The algorithm sorts the records by the first sort field according to the set order.

source: Альтернативный способ интеграции с MS SQL — использование ODBC-подключения.
en: The use of ODBC connection is an alternative method of integration with MS SQL.

source: Аналитик может повлиять на результат с помощью коэффициента отталкивания, и назначения максимального числа кластеров или итераций.
en: An analyst can have influence on the result by means of repulsion coefficient and determination of the maximum number of clusters or iterations.

source: Аналитик может создавать отчеты в предопределенных, наиболее востребованных разрезах, но не в силах предсказать все виды отчетов, которые могут потребоваться пользователю.
en: The analyst can create reports in the predetermined and most highly-demanded slices but he cannot forecast all kinds of reports that can be necessary to the user.

source: Аналогичные команды есть и в контекстном меню каждого узла в правом окне (корневой узел Root переместить нельзя).
en: There are similar commands in the context menu of each node in the right window (it is not possible to move Root root node).

source: Аналогичным образом можно сортировать записи по индексу поля в таблице (№).
en: It is possible to sort the records in the same manner by the field index in the table (No).

source: Антисимметричное без крайней точки.
en: Antisymmetric without extreme point

source: Антисимметричное;
en: Antisymmetric

source: Аргумент - выражение числового типа.
en: Argument - expression of the numeric type.

source: Аргумент - любое выражение;
en: Argument - any expression.

source: Аргумент - положительное числовое выражение.
en: Argument - integer positive numeric expression.

source: Аргумент - строковое выражение, содержащее дату/время
en: Argument - the string expression containing date/time.

source: Аргумент - строковое выражение.
en: Argument - string expression.

source: Аргумент - целое положительное числовое выражение.
en: Argument - integer positive numeric expression.

source: Аргумент - числовое выражение.
en: Argument - numeric expression.

source: Аргумент - числовое выражение;
en: Argument - numeric expression.

source: Аргумент - числовой код символа Unicode в диапазоне 0, 65535.
en: Argument - numerical code of Unicode character in the range of 0, 65535.

source: Аргумент логического типа.
en: Argument of the logical type.

source: Аргумент логического типа;
en: Argument of the logical type.

source: Аргумент числового типа.
en: Argument of the numeric type.

source: Аргумент1 - числовое выражение,
en: Argument1 - numeric expression.

source: Аргумент1,
en: Argument1.

source: Аргумент2 - необязательный параметр, количество цифр после запятой, целое число.
en: Argument2 - optional parameter, the number of digits following the decimal point, integer.

source: Аргумент2,
en: Argument2.

source: Аргумент - значение, для которого требуется вычислить плотность распределения.
en: Argument - value for which it is required to calculate the distribution density.

source: Аргументы - значения числового ряда
en: Arguments - values of the numeric series.

source: Аргументы - любые числовые выражения.
en: Arguments - any numeric expressions.

source: Аргументы отсутствуют.
en: Arguments are absent.

source: Аргументы, числовые выражения.
en: Arguments, numeric expressions.

source: Астра-инфо
en: Astra Info

source: Аутентификация
en: Authentification

source: БИК $1 указывается в платежном поручении
en: BIC $1 is specified in payment order

source: БИК 40147781 указывается в платежном поручении
en: BIC 40147781 is specified in payment order

source: БИК 40155000 указывается в платежном поручении
en: BIC 40155000 is specified in payment order

source: БИК банка
en: Bank BIC

source: БИК банка Замена
en: Replace bank BIC

source: Базовым узлом может выступать любой узел за исключением Цикла, Выполнения узла, Узла-ссылки, ссылки и производного узла на Подключение.
en: Any node can be the base node with the exception of Loop, Node execution, Reference node, reference derived node for Connection.

source: Базы данных:
en: Databases:

source: Без валидации.
en: No validation.

source: Без валидации
en: Without validation

source: Без валидации - валидация обучения Нейросети не производится.
en: No validation: validation of the Neural Network training is not performed.

source: Без задействований данной опции функции lower, upper работают только для букв латинского алфавита.
en: If this option is not enabled, lower, upper functions are available only for the Latin letters.

source: Без сжатия.
en: None

source: Без скрытых слоев.
en: No hidden layers.

source: Без скрытых слоев;
en: No hidden layers.

source: Без учета регистра ASCII символов.
en: Case-insensitive ASCII characters.

source: Без учета регистра.
en: Case-insensitive.

source: Бизнес приложения:
en: Business Applications:

source: Бинарная
en: Binary

source: Благодаря этому пользователи с ролью «Просмотр отчетов» получают доступ к единому узлу, где хранятся все преднастроенные отчеты проекта, что делает навигацию в системе более доступной и быстрой.
en: Consequently, the users with "View reports" role are provided with access to one node where all preconfigured project reports are kept that makes the system navigation more accessible and quicker.

source: Благодаря этому решения, созданные на базе Loginom, могут быть легко встроены в IT-ландшафт любой сложности.
en: Consequently, the solutions created on the Loginom base can be easily built into IT landscape of any complexity.

source: Благодаря этому слою, пользователь оперирует не полями и колонками таблиц базы данных, а многомерными понятиями, например, такими как измерение или факт.
en: Due to this layer a user can handle not fields and columns of the database tables, but such multidimensional concepts as dimension or measure.

source: Блок параметров, доступный для настройки, при неактивном флаге Автоопределение числа кластеров.
en: The pack of parameters available for configuration in the case of inactive checkbox: Auto selection of clusters.

source: Блок узлов, выполняющих формирование ТОП 10 клиентов, возможно, сгруппировать в отдельную функцию, поместив их в Подмодель.
en: The block of the nodes forming TOP 10 list of clients can be grouped as a separate function by placing them into the Supernode.

source: Блок-схема (граф переходов) реализованной стратегии автоподбора указана на рисунке ниже.
en: The flowgraph (transition graph) of the implemented autofit strategy is shown on the figure below.

source: Более высокое значение по сравнению с другими полями увеличивает шансы, что столбец будет присутствовать в финальной модели.
en: Higher value as compared with other fields increases a chance that the column will be included into the final model.

source: Более редкое.
en: Rarer.

source: Более редкое;
en: Rarer.

source: Более частое.
en: More frequent.

source: Более частое;
en: More frequent.

source: Больше факторов.
en: More factors.

source: Борьба с выбросами и экстремальными значениями — формирование меток интервала квантования при дискретизации непрерывного поля или объединение редких уникальных значений в одну категорию позволяет решить проблему экстремальных значений и выбросов.
en: The struggle against outliers and extreme values is based on formation of the binning range captions during discretization of the continuous field or union of rare unique values into one category that enables to solve the problem of extreme values and outliers.

source: Браузеры:
en: Browsers:

source: Быстрая.
en: Quick.

source: В 64-разрядных ОС используются два администратора источников данных ODBC 32-разрядный C:\Windows\SysWOW64\odbcad32.exe и 64-разрядный C:\Windows\System32\odbcad32.exe.
en: Two ODBC data sources administrators are used in 64 bit OS - 32 bit C:\Windows\SysWOW64\odbcad32.exe and 64 bit C:\Windows\System32\odbcad32.exe.

source: В Подмодели можно реализовать произвольную логику обработки и задать необходимую структуру входных и выходных данных.
en: It is possible to implement the random processing logics and set the required structure of input and output data in the Supernode.

source: В Предпросмотре узла JavaScript есть возможность контролировать работу скрипта в консоль консоли отладки кода.
en: It is possible to control the script operation in console of code debugging console in Preview of JavaScript node.

source: В Списке входных столбцов можно сортировать и фильтровать записи.
en: It is possible to sort and filter records in the List of input columns.

source: В Desktop версии
en: in the Desktop version

source: В Desktop-версии приложения, если проект не сохранен, то текущий каталог совпадает с текущим каталогом Loginom.
en: If the project is not saved, the current directory matches the current Loginom directory in the Desktop version.

source: В Loginom в зависимости от особенностей предметной области разрабатываемого Сценария или для оптимизации (например, увеличение скорости выполнения) можно задать собственную последовательность выполнения узлов (см.
en: In Loginom it is possible to set own order of nodes execution according to the subject area peculiarities of the designed Workflow or for the optimization purposes (for example, increase of the execution speed) (refer to

source: В Loginom есть инструменты интеграции с внешними веб-сервисами и публикации своих собственных.
en: Loginom provides the tools used for integration with external web services and publication of the own ones.

source: В Loginom имеется возможность подключаться к внешнему SOAP-сервису и импортировать полученные от него данные для дальнейшей обработки и анализа.
en: Loginom gives an opportunity to connect to the external SOAP service and import the data provided by it for further processing and analysis.

source: В Loginom имеется возможность создавать и использовать переменные.
en: In Loginom it is possible to create and use variables.

source: В Loginom используются все основные типы данных, которые делятся на дискретные и непрерывные (см.
en: All main data types classified into discrete and continuous are used in Loginom (refer to

source: В Loginom можно экспортировать данные в текстовый файл, XML-файл, электронные таблицы, внутренний формат программы, а также в базы данных.
en: In Loginom it is possible to export data to the text file, XML file, spreadsheets, internal application format and databases.

source: В Loginom существует механизм сокрытия портов порядка выполнения и портов управляющих переменных, т.е. по умолчанию они скрыты от пользователя:
en: In Loginom there is a mechanism of hidding of execution order ports and control variables ports, namely, they are hidden from a user by default:

source: В Loginom существует цветовая индикация портов.
en: The color indication of ports is used in Loginom.

source: В Loginom узлы Сценария принимают данные через входные порты, а отдают через выходные.
en: In Loginom the Workflow nodes accept data via the input ports and give them back via the output ones.

source: В SQL конструкциях возможно использование функции iLIKE, реализующей функциональность LIKE в режиме регистронезависимости символов Unicode.
en: It is possible to use iLIKE function in the SQL constructions. It implements LIKE feature in the case insensitivity mode of Unicode characters.

source: В SQL-запросах возможно использование переменных:
en: Variables can be used in the SQL queries in the following ways:

source: В Studio инструментом для создания таких функций являются производные компоненты.
en: The derived components are tools for creation of such functions in Studio.

source: В Мастере настройки узла Группировка поле Карта клиента задается как группа, а Сумма как показатель.
en: The Client Card field is set as a group, and the Sum is set as a parameter in the Grouping Node Wizard.

source: В Примере 1 &start_date и &end_date – конструкции подстановки значений входных переменных start_date и end_date узла импорта.
en: In Example 1 &start_date and &end_date are constructions of substitution of values of start_date and end_date input variables of the import node.

source: В Примере 2 %CONDITION% – конструкция подстановки значения входной переменной CONDITION узла импорта.
en: In Example 2 %CONDITION%: the construction of substitution of value of CONDITION input variable of the import node.
